* Git management related:

** List of files to add, remove and ignore:

*** The commit message:
#+begin_src conf :tangle message.txt
  Experiments to fix the blank image problem
#+end_src

*** Files to add:
#+begin_src conf :tangle git_add.txt
  main.org
  .gitignore
  README.org
  activate.sh
  install.sh
  configs.py
  image_reorganize.org
#+end_src

*** Files to remove:
#+begin_src conf :tangle rm.txt
  .#main.org
  .main.org.~undo-tree~
  #main.org#
  main.org~
  .README.org.~undo-tree~
  .#main.org
  .README.org.~undo-tree~
  .main.org.~undo-tree~
#+end_src

*** Files to ignore:
#+begin_src conf :tangle .gitignore
  EveryDream2trainer
  git_add.sh
  git_add.txt
  #main.org#
  message.txt
  #README.org#
  README.org~
  rm.sh
  rm.txt
  shrc_activate.sh
  shrc_install.sh
  tmp.sh
  every_dream_output/
  v1-inference.yaml
#+end_src

** The actual scripts to do the dirty work:

*** Files to add:
#+begin_src sh :shebang #!/bin/sh :tangle git_add.sh :results output
  sed "s/^/(git add '/g ; s/\$/');/g" 'git_add.txt' | sh
#+end_src

*** Files to remove:
#+begin_src sh :shebang #!/bin/sh :tangle rm.sh :results output
  sed "s/^/(rm -vf -- '/g ; s/\$/');/g" 'rm.txt' | sh
#+end_src

** Make all the changes and check status:

*** This file stuff:
#+begin_src emacs-lisp :results output
  (save-buffer) 
  (save-some-buffers) 
  (org-babel-tangle)
#+end_src

#+RESULTS:

*** Run the git management parts:
#+begin_src sh :shebang #!/bin/sh :results output
  ./git_add.sh
  ./rm.sh
  git status
#+end_src

#+RESULTS:
#+begin_example
removed '.main.org.~undo-tree~'
removed '.README.org.~undo-tree~'
On branch master
Your branch is up to date with 'origin/master'.

Changes to be committed:
  (use "git restore --staged <file>..." to unstage)
	modified:   README.org
	modified:   main.org

Untracked files:
  (use "git add <file>..." to include in what will be committed)

#+end_example

** Commit the changes and push:
#+begin_src sh :shebang #!/bin/sh :results output
  git commit -m "$(cat 'message.txt')"
  # git remote add origin 'git@github.com:aravind-h-v/every_dream_2.git'
  git push -u origin master
#+end_src

#+RESULTS:
: [master 6e10c2d] Fixed with stuff to get realistic stuff
:  3 files changed, 1587 insertions(+), 10 deletions(-)
:  create mode 100644 image_reorganize.org
: Branch 'master' set up to track remote branch 'master' from 'origin'.
